In [85]:
import pandas as pd
import numpy as np
import random

In [86]:
a = pd.Series(np.array(np.random.randint(1, 10, size=6)))

In [87]:
a # index   |   value

0    7
1    3
2    3
3    5
4    8
5    9
dtype: int32

In [88]:
a.name = 'Data Angka'

In [89]:
a

0    7
1    3
2    3
3    5
4    8
5    9
Name: Data Angka, dtype: int32

In [90]:
a.values

array([7, 3, 3, 5, 8, 9])

In [91]:
a.index

RangeIndex(start=0, stop=6, step=1)

In [92]:
a.index = [
    'Angka 1',
    'Angka 2',
    'Angka 3',
    'Angka 4',
    'Angka 5',
    'Angka 6'
]

In [93]:
a

Angka 1    7
Angka 2    3
Angka 3    3
Angka 4    5
Angka 5    8
Angka 6    9
Name: Data Angka, dtype: int32

In [94]:
b = pd.Series({
    'Angka 1' : 1,
    'Angka 2' : 2,
    'Angka 3' : 3,
    'Angka 4' : 4,
    'Angka 5' : 5
}, name='Data Angka')

In [95]:
b # key |  value

Angka 1    1
Angka 2    2
Angka 3    3
Angka 4    4
Angka 5    5
Name: Data Angka, dtype: int64

In [96]:
c = pd.Series(
    np.array(np.random.randint(1,10, size=5)),
    index=['Angka 1','Angka 2','Angka 3','Angka 4','Angka 5'],
    name='Data Angka'
)

In [97]:
c

Angka 1    6
Angka 2    3
Angka 3    9
Angka 4    3
Angka 5    1
Name: Data Angka, dtype: int32

In [98]:
c['Angka 1':'Angka 4']

Angka 1    6
Angka 2    3
Angka 3    9
Angka 4    3
Name: Data Angka, dtype: int32

In [99]:
c.iloc[0:3]

Angka 1    6
Angka 2    3
Angka 3    9
Name: Data Angka, dtype: int32

In [100]:
a[a>5]

Angka 1    7
Angka 5    8
Angka 6    9
Name: Data Angka, dtype: int32

In [101]:
a>5

Angka 1     True
Angka 2    False
Angka 3    False
Angka 4    False
Angka 5     True
Angka 6     True
Name: Data Angka, dtype: bool

In [102]:
d = {
    'Series' : [1,2,3,4,5],
    'Product' : ['Produk 1','Produk 2','Produk 3','Produk 4','Produk 5'],
    'Quantity' : [5,10,15,20,25],
    'Price' : np.arange(25,0,-5),
    'Sales' : [125,200,225,200,125]
}

In [103]:
df = pd.DataFrame(d,columns=['Series','Product','Quantity','Price','Sales'],index=list('abcde'))

In [104]:
df

   Series   Product  Quantity  Price  Sales
a       1  Produk 1         5     25    125
b       2  Produk 2        10     20    200
c       3  Produk 3        15     15    225
d       4  Produk 4        20     10    200
e       5  Produk 5        25      5    125

In [105]:
df['Product']

a    Produk 1
b    Produk 2
c    Produk 3
d    Produk 4
e    Produk 5
Name: Product, dtype: object

In [106]:
df.loc['a']

Series             1
Product     Produk 1
Quantity           5
Price             25
Sales            125
Name: a, dtype: object

In [107]:
df.iloc[2]

Series             3
Product     Produk 3
Quantity          15
Price             15
Sales            225
Name: c, dtype: object

In [108]:
df

   Series   Product  Quantity  Price  Sales
a       1  Produk 1         5     25    125
b       2  Produk 2        10     20    200
c       3  Produk 3        15     15    225
d       4  Produk 4        20     10    200
e       5  Produk 5        25      5    125

In [109]:
def coba(coba):
    return coba % 2 == 0

In [110]:
df['Coba'] = df['Quantity'].map(coba) #function coba akan mengeksekusi value dari kolom quantity secara satu persatu
display(df)

   Series   Product  Quantity  Price  Sales   Coba
a       1  Produk 1         5     25    125  False
b       2  Produk 2        10     20    200   True
c       3  Produk 3        15     15    225  False
d       4  Produk 4        20     10    200   True
e       5  Produk 5        25      5    125  False

In [111]:
df["Coba"] = df["Coba"].map({True:"Genap",False:"Ganjil"})
display(df)

   Series   Product  Quantity  Price  Sales    Coba
a       1  Produk 1         5     25    125  Ganjil
b       2  Produk 2        10     20    200   Genap
c       3  Produk 3        15     15    225  Ganjil
d       4  Produk 4        20     10    200   Genap
e       5  Produk 5        25      5    125  Ganjil

In [113]:
df.set_index('Series',inplace=True)

In [116]:
df.loc[1]

Product     Produk 1
Quantity           5
Price             25
Sales            125
Coba          Ganjil
Name: 1, dtype: object